src/logs/api/test-api-top-bet-volume-20250730-165516.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: src/tests/api/test-api-top-bet-volume.ts
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 30 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 30/30 VUs, 30 complete and 0 interrupted iterations
default   [   3% ] 30 VUs  01.0s/30s

running (0m02.0s), 30/30 VUs, 89 complete and 0 interrupted iterations
default   [   7% ] 30 VUs  02.0s/30s

running (0m03.0s), 30/30 VUs, 149 complete and 0 interrupted iterations
default   [  10% ] 30 VUs  03.0s/30s

running (0m04.0s), 30/30 VUs, 200 complete and 0 interrupted iterations
default   [  13% ] 30 VUs  04.0s/30s

running (0m05.0s), 30/30 VUs, 242 complete and 0 interrupted iterations
default   [  17% ] 30 VUs  05.0s/30s

running (0m06.0s), 30/30 VUs, 301 complete and 0 interrupted iterations
default   [  20% ] 30 VUs  06.0s/30s

running (0m07.0s), 30/30 VUs, 360 complete and 0 interrupted iterations
default   [  23% ] 30 VUs  07.0s/30s

running (0m08.0s), 30/30 VUs, 420 complete and 0 interrupted iterations
default   [  27% ] 30 VUs  08.0s/30s

running (0m09.0s), 30/30 VUs, 480 complete and 0 interrupted iterations
default   [  30% ] 30 VUs  09.0s/30s

running (0m10.0s), 30/30 VUs, 540 complete and 0 interrupted iterations
default   [  33% ] 30 VUs  10.0s/30s

running (0m11.0s), 30/30 VUs, 600 complete and 0 interrupted iterations
default   [  37% ] 30 VUs  11.0s/30s

running (0m12.0s), 30/30 VUs, 660 complete and 0 interrupted iterations
default   [  40% ] 30 VUs  12.0s/30s

running (0m13.0s), 30/30 VUs, 720 complete and 0 interrupted iterations
default   [  43% ] 30 VUs  13.0s/30s

running (0m14.0s), 30/30 VUs, 780 complete and 0 interrupted iterations
default   [  47% ] 30 VUs  14.0s/30s

running (0m15.0s), 30/30 VUs, 837 complete and 0 interrupted iterations
default   [  50% ] 30 VUs  15.0s/30s

running (0m16.0s), 30/30 VUs, 897 complete and 0 interrupted iterations
default   [  53% ] 30 VUs  16.0s/30s

running (0m17.0s), 30/30 VUs, 954 complete and 0 interrupted iterations
default   [  57% ] 30 VUs  17.0s/30s

running (0m18.0s), 30/30 VUs, 1014 complete and 0 interrupted iterations
default   [  60% ] 30 VUs  18.0s/30s

running (0m19.0s), 30/30 VUs, 1074 complete and 0 interrupted iterations
default   [  63% ] 30 VUs  19.0s/30s

running (0m20.0s), 30/30 VUs, 1130 complete and 0 interrupted iterations
default   [  67% ] 30 VUs  20.0s/30s

running (0m21.0s), 30/30 VUs, 1185 complete and 0 interrupted iterations
default   [  70% ] 30 VUs  21.0s/30s

running (0m22.0s), 30/30 VUs, 1239 complete and 0 interrupted iterations
default   [  73% ] 30 VUs  22.0s/30s

running (0m23.0s), 30/30 VUs, 1299 complete and 0 interrupted iterations
default   [  77% ] 30 VUs  23.0s/30s

running (0m24.0s), 30/30 VUs, 1359 complete and 0 interrupted iterations
default   [  80% ] 30 VUs  24.0s/30s

running (0m25.0s), 30/30 VUs, 1419 complete and 0 interrupted iterations
default   [  83% ] 30 VUs  25.0s/30s

running (0m26.0s), 30/30 VUs, 1479 complete and 0 interrupted iterations
default   [  87% ] 30 VUs  26.0s/30s

running (0m27.0s), 30/30 VUs, 1538 complete and 0 interrupted iterations
default   [  90% ] 30 VUs  27.0s/30s

running (0m28.0s), 30/30 VUs, 1594 complete and 0 interrupted iterations
default   [  93% ] 30 VUs  28.0s/30s

running (0m29.0s), 30/30 VUs, 1650 complete and 0 interrupted iterations
default   [  97% ] 30 VUs  29.0s/30s

running (0m30.0s), 30/30 VUs, 1710 complete and 0 interrupted iterations
default   [ 100% ] 30 VUs  30.0s/30s


  █ TOTAL RESULTS 

    checks_total.......................: 1740    57.346833/s
    checks_succeeded...................: 100.00% 1740 out of 1740
    checks_failed......................: 0.00%   0 out of 1740

    ✓ status is 200

    HTTP
    http_req_duration.......................................................: avg=14.65ms  min=4.53ms   med=8.77ms   max=164.35ms p(90)=31.09ms  p(95)=47.95ms 
      { expected_response:true }............................................: avg=14.65ms  min=4.53ms   med=8.77ms   max=164.35ms p(90)=31.09ms  p(95)=47.95ms 
    http_req_failed.........................................................: 0.00%  0 out of 1740
    http_reqs...............................................................: 1740   57.346833/s

    EXECUTION
    iteration_duration......................................................: avg=520.28ms min=504.92ms med=510.09ms max=832.54ms p(90)=537.62ms p(95)=580.68ms
    iterations..............................................................: 1740   57.346833/s
    vus.....................................................................: 30     min=30        max=30
    vus_max.................................................................: 30     min=30        max=30

    NETWORK
    data_received...........................................................: 3.0 MB 98 kB/s
    data_sent...............................................................: 254 kB 8.4 kB/s



running (0m30.3s), 00/30 VUs, 1740 complete and 0 interrupted iterations
default ✓ [ 100% ] 30 VUs  30s